In [ ]:
# create data with name city age
# each column has 4 values
# each column we will miss one value

In [1]:
dict1={'names':['ramesh','suresh','mahesh',None],
      'age':[20,21,None,22],
      'city':[None,'hyd','pune','berhampur']}
dict1

{'names': ['ramesh', 'suresh', 'mahesh', None],
 'age': [20, 21, None, 22],
 'city': [None, 'hyd', 'pune', 'berhampur']}

In [2]:
import pandas as pd
import numpy as np
data=pd.DataFrame(dict1)
data

    names   age       city
0  ramesh  20.0       None
1  suresh  21.0        hyd
2  mahesh   NaN       pune
3    None  22.0  berhampur

- while creating we provided none 

- but by default the data frame adjust the data type

- where int is given as Nan and string is given as none

- when we look it we get empty sace

In [3]:
data.to_csv('data1.csv',index=False)

In [6]:
dict2={'names':['ramesh','suresh','mahesh',np.nan],
      'age':[20,21,np.nan,22],
      'city':[np.nan,'hyd','pune','berhampur']}
dict2
data2=pd.DataFrame(dict2)
data2

    names   age       city
0  ramesh  20.0        NaN
1  suresh  21.0        hyd
2  mahesh   NaN       pune
3     NaN  22.0  berhampur

In [7]:
data2.to_csv('data2.csv',index=False)

In [9]:
data1.isnull().sum()

names    1
age      1
city     1
dtype: int64

In [10]:
data1.isnull()

   names    age   city
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [11]:
data1.fillna(25) # all null value replace with 25

    names   age       city
0  ramesh  20.0         25
1  suresh  21.0        hyd
2  mahesh  25.0       pune
3      25  22.0  berhampur

In [12]:
data1['names'].fillna('manish')

0    ramesh
1    suresh
2    mahesh
3    manish
Name: names, dtype: object

In [13]:
data1

    names   age       city
0  ramesh  20.0        NaN
1  suresh  21.0        hyd
2  mahesh   NaN       pune
3     NaN  22.0  berhampur

- pad

- ffill

- backfill

- bfill

- do not give any value only provide method='pad'

- to fill missing values we using these methods

- ffil and pad are same

- bfill and backfill both are same

In [14]:
data1.fillna(method='pad')

    names   age       city
0  ramesh  20.0        NaN
1  suresh  21.0        hyd
2  mahesh  21.0       pune
3  mahesh  22.0  berhampur

In [19]:
data1.fillna(method='pad',axis=1)

    names     age       city
0  ramesh    20.0       20.0
1  suresh    21.0        hyd
2  mahesh  mahesh       pune
3     NaN    22.0  berhampur

In [20]:
data1.fillna(method='pad',axis=0)

    names   age       city
0  ramesh  20.0        NaN
1  suresh  21.0        hyd
2  mahesh  21.0       pune
3  mahesh  22.0  berhampur

In [15]:
data1.fillna(method='ffill')

    names   age       city
0  ramesh  20.0        NaN
1  suresh  21.0        hyd
2  mahesh  21.0       pune
3  mahesh  22.0  berhampur

In [21]:
data1.fillna(method='ffill',axis=0)

    names   age       city
0  ramesh  20.0        NaN
1  suresh  21.0        hyd
2  mahesh  21.0       pune
3  mahesh  22.0  berhampur

In [22]:
data1.fillna(method='ffill',axis=1)

    names     age       city
0  ramesh    20.0       20.0
1  suresh    21.0        hyd
2  mahesh  mahesh       pune
3     NaN    22.0  berhampur

In [16]:
data1.fillna(method='backfill')

    names   age       city
0  ramesh  20.0        hyd
1  suresh  21.0        hyd
2  mahesh  22.0       pune
3     NaN  22.0  berhampur

In [23]:
data1.fillna(method='backfill',axis=0)

    names   age       city
0  ramesh  20.0        hyd
1  suresh  21.0        hyd
2  mahesh  22.0       pune
3     NaN  22.0  berhampur

In [24]:
data1.fillna(method='backfill',axis=1)

    names   age       city
0  ramesh  20.0        NaN
1  suresh  21.0        hyd
2  mahesh  pune       pune
3    22.0  22.0  berhampur

In [17]:
data1.fillna(method='bfill')

    names   age       city
0  ramesh  20.0        hyd
1  suresh  21.0        hyd
2  mahesh  22.0       pune
3     NaN  22.0  berhampur

In [25]:
data1.fillna(method='bfill',axis=0)

    names   age       city
0  ramesh  20.0        hyd
1  suresh  21.0        hyd
2  mahesh  22.0       pune
3     NaN  22.0  berhampur

In [26]:
data1.fillna(method='bfill',axis=1)

    names   age       city
0  ramesh  20.0        NaN
1  suresh  21.0        hyd
2  mahesh  pune       pune
3    22.0  22.0  berhampur

- when ever we get warnings

- import warnings

- warning.filterwarning('ignore')

**mean-median-mode**

In [8]:
# first chose the column 
# if it is numerical column then fill with mean or median
# if it is categorical column then fill with mode
data1

    names   age       city
0  ramesh  20.0        NaN
1  suresh  21.0        hyd
2  mahesh   NaN       pune
3     NaN  22.0  berhampur

In [9]:
mean_age=data1['age'].mean()
data1['age'].fillna(mean_age)

0    20.0
1    21.0
2    21.0
3    22.0
Name: age, dtype: float64

In [10]:
median_age=data1['age'].median()
data1['age'].fillna(median_age)

0    20.0
1    21.0
2    21.0
3    22.0
Name: age, dtype: float64

In [11]:
data1['city'].mode()

0    berhampur
1          hyd
2         pune
Name: city, dtype: object

In [12]:
dict2={'names':['ramesh','suresh','mahesh',np.nan],
      'age':[20,21,np.nan,22],
      'city':[np.nan,'hyd','pune','pune']}
dict2
data1=pd.DataFrame(dict2)
data1

    names   age  city
0  ramesh  20.0   NaN
1  suresh  21.0   hyd
2  mahesh   NaN  pune
3     NaN  22.0  pune

In [13]:
mode_city=data1['city'].mode()
data1['city'].fillna(mode_city)

0    pune
1     hyd
2    pune
3    pune
Name: city, dtype: object

In [14]:
mean_age,median_age,mode_city

(21.0,
 21.0,
 0    pune
 Name: city, dtype: object)

In [38]:
median_age

21.0

In [45]:
mode_city.values[0]

'pune'

- to fill missing values

- random value

- pad

- ffill

- bfill

- backfill

- mean

- median

- mode

In [ ]:
missing value analysis done before outliers only

either values

**KNN imputer**

- KNN means k-nearest neighbhours

- we will chose the less distance samples

In [48]:
# package name= sklearn
# class name= imputer
# method name= KNNImputer


# read the method
# save method
# Apply fit transfor

from sklearn.impute import KNNImputer
knn=KNNImputer()
knn.fit_transform(data[['age']])

array([[20.],
       [21.],
       [21.],
       [22.]])

In [17]:
from sklearn.impute import KNNImputer
knn=KNNImputer()
knn.fit_transform(data[['city']])

ValueError: could not convert string to float: 'hyd'